app/controllers/home_controller.rb

  def index
    if(params[:search].present?)
     @search_result = User.paginate :page => params[:page], :conditions => ['name LIKE ? OR email LIKE ?', "%" + params[:search] + "%", "%" + params[:search] + "%"]
---
SELECT COUNT(*) FROM `users` WHERE (name LIKE '%abhi%' OR email LIKE '%abhi%')
SELECT `users`.* FROM `users` WHERE (name LIKE '%abhi%' OR email LIKE '%abhi%') LIMIT 2 OFFSET 0