app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` WHERE (name LIKE '%abhi%' OR email LIKE '%abhi%') LIMIT 2 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page])

INSERT INTO `users` (`name`, `phone`, `email`, `type`, `created_at`, `updated_at`) VALUES ('abhijit', 45345345345, 'abhijit.chavan@wwindia.com', NULL, '2011-09-30 09:11:21', '2011-09-30 09:11:21')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `customer_type` = 'bad customer', `updated_at` = '2011-09-30 10:41:36' WHERE `users`.`id` = 5
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])